---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailSupportJustification.Center
enum: Autodesk.Revit.DB.Architecture.RailSupportJustification
source: html/4f72a67f-23eb-5b4c-2cc1-77731e5599ea.htm
---
# Autodesk.Revit.DB.Architecture.RailSupportJustification.Center

Supports are justified to the center of the rail.